import java.io.BufferedReader;
import java.io.FileReader;
import java.util.ArrayList;

public class Test {
	public static void main(String[] args) throws Exception{
		predict();
  	}
	
	public static void predict(){
		Cropus cp = Cropus.restore("gibbs1000");
		String docstr = "暂停 了 4 个 月 的 大盘股 IPO 审核 重新 开闸 中国 建筑 股份 公司 首发 已经 过 会 计划 发行 120亿A 股 预计 融资 规模 超过 400亿 元 为 年内 最大 规模 的 IPO 远 高于 排名 第二 的 中煤 能源 的 257亿 元 近期 跌破 首发价 的 股票 开始 增多 从 2007年 以来 上市 的 新股 已经 有 12 家 上市 公司 破发 包括 中国 太保 中国 石油 交通 银行 中国 铁建 南洋 股份 建设 银行 劲嘉 股份 威华 股份 滨江 集团 中信 银行 中海 集运 中煤 能源 其中 有 9 只 是 在 6月 10日 后 出现 那么 投资者 是否 该 把握 新股 申购 的 机会 呢 又 该 注意 哪些 问题 呢 调整 格局 应 把握 申购 机会 1 成交 清淡 暗示 调整 将 持续 近期 市场 呈现 缩量 下跌 走势 日 成交 金额 均 处于 1000亿 元 以下 的 水平 极 少 的 抛单 便 造成 了 较 大 的 跌幅 显示 在 目前 3000 点 附近 的 点位 仍 不 能 吸引 场外 资金 进场 吸纳 市场 的 调整 恐 将 持续 既然 二 级 市场 的 机会 不 多 投资者 不妨 将 闲置 资金 用于 新股 申购 以 获得 无 风险 收益 尽管 近期 较 多 股票 在 上市 首日 高 定位 之后 出现 了 持续 下滑 但 在 A 股市 场上 上市 首日 跌破 发行价 的 概率 极小 上 一 次 出现 上市 首日 跌破 发行价 的 是 2006年 8月份 首 发 上市 的 中国 国航 所以 说 申购 新股 可以 被 看做 无 风险 套利 2 大盘股 发行 和 密集 发行 将 提高 中签率 所谓 中签率 就是 发行 股数 除以 有效 申购 股数 即 中签 的 概率 这样 融资 规模 通常 与 中签率 成 正比 关系 发行 规模 越 大 中签率 越高 如 今年 以来 首发 上市 募集 资金 额 最 大 的 四 家 公司 中煤 能源 中国 铁建 紫金 矿业 金钼 股份 募集 资金 规模 分别 为 256.71亿 元 222.46亿 元 99.82亿 元 89.15亿 元 网上 申购 中签率 则 分别 为 0.73% 0.64% 0.37% 0.32% 而 余下 44 家 中 小 板 上市 公司 融资额 均 在 16亿 元 以下 中签率 则 均 在 0.25% 以下 0.20% 以下 的 为 40 家 另外 多 只 中 小 板 上市 公司 同日 发行 也 会 提高 中签率 中签率 的 上升 将 给予 投资者 良好 的 申购 机会 3 大盘股 发行 将 冻结 大量 资金 由于 大盘股 发行 的 中签率 高 往往 吸引 资金 踊跃 申购 对 二 级 市场 资金 产生 较 大 的 分流 作用 从而 对 二 级 市场 行情 产生 一定 的 负面 影响 不 会 造成 二 级 市场 投资 机会 的 缺失 其中 网上 申购 资金 会 冻结 三 个 交易日 网下 申购 资金 一般 会 冻结 三 个 月 金钼 股份 首 发 网上 网下 共 冻结 资金 2.2万亿 元 中国 铁建 为 3.1万亿 元 中煤 能源 为 3.1万亿 元 中建 股份 发行 时 也 会 冻结 大量 资金 既然 不 会 错失 二 级 市场 的 投资 机会 投资者 更应 积极 参与 大盘股 的 首发 申购 中签 新股 应 注意 三 大 问题 投资者 中签 之后 该 如何 操作 新股 呢 有的 在 上市 首日 匆匆 卖出 有的 自认为 成本 较 低 立足 中长期 持有 那么 对于 中签 之后 的 新股 投资者 该 树立 怎样 的 操作 理念 呢 1 多数 新股 首发 市盈率 接近 二 级 市场 平均 水平 今年 以来 首发 上市 的 新股 多数 走势 不 佳 既有 二 级 市场 运行 态势 偏 弱 的 影响 也 有的 首发 市盈率 并不 低 理论 上 并 未 留出 较大 的 溢价 空间 而 上市 首日 过 高 的 定位 往往 造成 理性 的 价值 回归 今年 以来 首发 上市 的 48 只 股票 中 首 发 市盈率 在 20 倍 以下 的 仅有 4 只 30 倍 以上 的 仅有 4 只 大多数 新股 首发 市盈率 处于 20 倍 至 30 倍 之间 而 目前 剔除 亏损 公司 的 A股 市盈率 仅 为 28 倍 尽管 部分 新股 要 考虑 募集 资金 后 的 动态 市盈率 但 多数 新股 理论 上在 上市 后 不 应 有 过大 的 溢价 幅度 2 网下 申购 部分 的 套现 行为 需 警惕 目前 新股 上市 后 需要 面临 两 类 限 售 股 解冻 后 的 套现 行为 一 类 是 首次 公开 发行 前 已 发行 的 股份 属于 上市 公司 解除 限 售 存量 股份 转让 指导 意见 中 定义 的 存量 股份 即 持股 股东 预计 未来 一 个 月 内 公开 出售 解除 限 售 存量 股份 的 数量 超过 该 公司 股份 总数 1% 的 应当 通过 证券 交易所 大宗 交易 系统 转让 所持 股份 另 一 类 是 网下 发行 配售 部分 一般 法人 的 限 售 期 一般 为 三 个 月 战略 投资者 的 限 售 期 一般 为 十二 个 月 但 不属于 存量 股份 而 多数 机构 配售 部分 的 股数 均 占 公司 总 股本 比例 1% 以下 这样 投资者 对于 新股 的 限 售 股 解冻 应 加以 警惕 尤其 是非 存量 股份 的 部分 3 上市 首日 可以 考虑 卖出 今年 以来 首发 上市 的 48 只 股票 中 上市 后 五 个 交易日 的 累计 涨跌幅 小于 上市 首日 涨跌幅 的 有 39 只 也 就是说 八成多 的 新股 在 上市 后 一 周 涨幅 处于 收 窄 状况 上市 首日 反而 获得 较大 的 涨幅 其中 35 只 新股 的 上市 以来 最高 价 是 在 上市 后 五 个 交易日 内 获得 的 25 只 新股 的 上市 以来 最高 价 是 在 上市 首日 获得 的 那么 投资者 如果 将 中签 后 的 新股 在 上市 首日 的 高点 卖出 有 五 成 的 把握 将 可能 是 较 长 时间 的 最高 价 而 其它 评判 指标 并不 可靠 上市 首日 换 手率 过 高 的 新股 在 80% 以上 后续 走势 既有 再 创 新高 的 如 科大 讯飞 恒邦 股份 等 也 有 较差 的 如独 一 味 达意 隆 等 上市 首日 换 手率 过低 的 新股 在 60% 以下 也 出现 差异化 后续 再 创 新高 的 有宏达 新材 走势 较 差 的 有 中煤 能源 而从 上市 首日 涨幅 看 首 日 涨幅 过大 的 股票 100% 以上 其后 走势 多数 不 佳 但 涨幅 过小 的 股票 50% 以下 则 后 势 呈现 差异化 发展 由此 我们 得出 结论 投资者 在 目前 市场 格局 下 应 积极 参与 新股 申购 把握 无 风险 套利 机会 但 如果 没有 太 大 的 把握 不 建议 将 中签 后 的 新股 长期 持有 在 上市 首日 套 现 或是 较为 稳妥 的 选择 而 上市 首日 的 涨跌幅 和 换手率 对 判断 后势 走向 的 帮助 不大  搜狐 证券 声明 本 频道 资讯 内容 系 转 引自 合作 媒体 及 合作 机构 不 代表 搜狐 证券 自身 观点 与 立场 建议 投资者 对此 资讯 谨慎 判断 据此 入市 风险 自担 责任 编辑 陈兴然 ";
		Document dc = new Document(docstr.split(" "), cp.voc,true);
		GibbsLDA.predict(dc, cp, 10, 3, 1, 10);
		for(double d : dc.topic){
			int tp = (int) (d * 100);
			if (tp < 10) {
				System.out.print("00" + tp + " ");
			} else if (tp < 100) {
				System.out.print("0" + tp + " ");
			} else {
				System.out.print(tp + " ");
			}
		}
	}
	
	public static void train() throws Exception{
		BufferedReader br = new BufferedReader(new FileReader("news_seg.txt"));
		ArrayList<String> docslist = new ArrayList<String>();
		String tmp = null;
		int count = 0;
		while((tmp=br.readLine())!=null){
			if(tmp.length()<500) continue;
			docslist.add(tmp);
			count++;
			if(count>=10000) break;
		}
		String[] docs = docslist.toArray(new String[docslist.size()]);
		Cropus cp = Cropus.getCropus(docs);
		GibbsLDA.train(cp, 10, 3, 1, 10,false);
		cp.save("gibbs1000");
		cp.result();
	}
}